In [7]:
import pandas as pd
import numpy as np
ser1 = pd.Series(np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [10]:
ser1[1:3]

1    10
2    20
dtype: int32

In [13]:
import pandas as pd
import numpy as np
index = ['a', 'b', 'c', 'd']
ser2 = pd.Series(np.arange(4)*10, index) # 인덱스 값 주기
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [18]:
ser2['b':'d'] # 라벨 이름으로 슬라이싱 하면 끝자리도 포함한다. !!주의!! 숫자는 끝점에서 자르는거 기억합시다.

b    10
c    20
d    30
dtype: int32

In [23]:
data = np.arange(16).reshape(4,4)
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one', 'two', 'three', 'four']
df1 = pd.DataFrame(data, index, columns)
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
df1.four

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [27]:
df1[['two', 'four']] # 원하는 칼럼 추출

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [33]:
# df1[['two':'four']] row에서만 가능해!!

In [35]:
df1[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
df1[df1['three']>5] # 세번째 칼럼이 5 이상인 녀석만 추출

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
# loc과 iloc로 선택하기
df1.loc['Colorado', ['two', 'three']] # loc는 설정되어 있는 인덱싱으로 추출
                                      # iloc는 기존의 오리지널 행 번호로 추출

two      5
three    6
Name: Colorado, dtype: int32

In [39]:
df1.iloc[1,[1,2]]
                 # loc는 설정되어 있는 인덱싱으로 추출
                 # iloc는 기존의 오리지널 행 번호로 추출

two      5
three    6
Name: Colorado, dtype: int32

In [41]:
df1.loc[['Colorado','Utah'], ['two', 'three']] # 여러 행 , 칼럼 추출 가능

          two  three
Colorado    5      6
Utah        9     10

In [43]:
df1.iloc[[1,2], [1,2]] # 여러 행 , 칼럼 추출 가능

          two  three
Colorado    5      6
Utah        9     10

In [45]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], 
               index=['a','c','d','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], 
               index=['a','c','e','f','g'])
# 양쪽 다 없을 경우엔 그렇다고 하지만 한쪽만 있는 경우에도 NaN 값이 나옴
# 대응 되는 색인이 없는 경우 데이터 값이 NaN이 된다.

In [46]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64